Revit 2026 API

# RebarContainerIterator Class

---

An iterator to a Rebar Container.

SystemObject Autodesk.Revit.DB.StructureRebarContainerIterator

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarContainerIterator : IEnumerator<RebarContainerItem>
```
```vb
Public Class RebarContainerIterator
	Implements IEnumerator(Of RebarContainerItem)
```
```cpp
public ref class RebarContainerIterator : IEnumerator<RebarContainerItem^>
```
```fsharp
type RebarContainerIterator =
    class
        interface IEnumerator<RebarContainerItem>
    end
```

The RebarContainerIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RebarContainerIterator |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | MoveNext | Increments the iterator to the next item. |
|  | Reset | Resets the iterator to the initial state. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Structure Namespace